# This notebook was exported from Google Colab. We had to export because Keras and TensorFlow would not run on Jupyter

# Importing libraries and loading in the data

In [1]:
# Initial imports
import pandas as pd
import numpy as np
from google.colab import files
files.upload()

Saving application_record.csv to application_record.csv

In [4]:
# Display first 5 rows of app_data
app_data = pd.read_csv("application_record.csv")
app_data.head()

        ID CODE_GENDER  ... OCCUPATION_TYPE CNT_FAM_MEMBERS
0  5008804           M  ...             NaN             2.0
1  5008805           M  ...             NaN             2.0
2  5008806           M  ...  Security staff             2.0
3  5008808           F  ...     Sales staff             1.0
4  5008809           F  ...     Sales staff             1.0

[5 rows x 18 columns]

In [5]:
# Display first 5 rows of CrRecord_data
files.upload()
CrRecord_data = pd.read_csv("credit_record.csv")
CrRecord_data.head()

Saving credit_record.csv to credit_record.csv

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

# Data Cleaning

In [8]:
# Dataframe information for app_data
app_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
ID                     438557 non-null int64
CODE_GENDER            438557 non-null object
FLAG_OWN_CAR           438557 non-null object
FLAG_OWN_REALTY        438557 non-null object
CNT_CHILDREN           438557 non-null int64
AMT_INCOME_TOTAL       438557 non-null float64
NAME_INCOME_TYPE       438557 non-null object
NAME_EDUCATION_TYPE    438557 non-null object
NAME_FAMILY_STATUS     438557 non-null object
NAME_HOUSING_TYPE      438557 non-null object
DAYS_BIRTH             438557 non-null int64
DAYS_EMPLOYED          438557 non-null int64
FLAG_MOBIL             438557 non-null int64
FLAG_WORK_PHONE        438557 non-null int64
FLAG_PHONE             438557 non-null int64
FLAG_EMAIL             438557 non-null int64
OCCUPATION_TYPE        304354 non-null object
CNT_FAM_MEMBERS        438557 non-null float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [9]:
# Renaming the columns for app_data
app_data = app_data.rename(columns={"ID": "Client Number", "CODE_GENDER": "Gender", "FLAG_OWN_CAR": "Own a Car?",
                                   "FLAG_OWN_REALTY":"Own Property?", "CNT_CHILDREN": "# of Children","AMT_INCOME_TOTAL": "Annual Income",
                                   "NAME_INCOME_TYPE": "Income Category", "NAME_EDUCATION_TYPE": "Education Level",
                                   "NAME_FAMILY_STATUS": "Marital Status", "NAME_HOUSING_TYPE": "Housing type",
                                   "DAYS_BIRTH": "Birthday", "DAYS_EMPLOYED": "Start Date of Employment",
                                   "OCCUPATION_TYPE": "Occupation", "CNT_FAM_MEMBERS": "Family Size",
                                   "FLAG_MOBIL": "Have a Mobile Phone?", "FLAG_WORK_PHONE": "Have a Work Phone?",
                                   "FLAG_PHONE": "Have a Phone?", "FLAG_EMAIL": "Have an Email?"})
app_data.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Birthday,Start Date of Employment,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [10]:
# Converting birthdays to age in years
app_data["Age"] = round(app_data["Birthday"]/364.25 * -1, 0)
app_data = app_data.astype({'Age': 'int64'})
app_data.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Birthday,Start Date of Employment,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size,Age
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,33
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,33
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0,59
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0,52
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0,52

In [11]:
# Converting start date of employment to "years working at current job"
app_data["Years Working at Current Job"] = round(app_data["Start Date of Employment"]/364.25 * -1, 1)
app_data = app_data.astype({'Years Working at Current Job': 'float64'})
app_data.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Birthday,Start Date of Employment,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size,Age,Years Working at Current Job
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,33,12.5
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,33,12.5
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0,59,3.1
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0,52,8.4
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0,52,8.4

In [12]:
# Deleting "Birthday" and "Start Date of Employment" columns
del app_data["Birthday"]
del app_data["Start Date of Employment"]
app_data.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size,Age,Years Working at Current Job
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,NaN,2.0,33,12.5
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,NaN,2.0,33,12.5
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,1,0,0,0,Security staff,2.0,59,3.1
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1,0,1,1,Sales staff,1.0,52,8.4
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1,0,1,1,Sales staff,1.0,52,8.4

In [13]:
# Filling in null/blank values (All null/blank values in the dataset were in the "Occupation column.")
app_data = app_data.fillna("N/A")

In [14]:
# Changing the data type of the Family Size column in app_data to int64
app_data = app_data.astype({'Family Size': 'int64'})

In [15]:
# Dropping any possible duplicates in app_data
app_data = app_data.drop_duplicates()

In [16]:
# Checking new dataframe
app_data.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size,Age,Years Working at Current Job
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,1,0,0,0,Security staff,2,59,3.1
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1,0,1,1,Sales staff,1,52,8.4
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1,0,1,1,Sales staff,1,52,8.4

In [17]:
# Updated dataframe information for app_data
app_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 438557 entries, 0 to 438556
Data columns (total 18 columns):
Client Number                   438557 non-null int64
Gender                          438557 non-null object
Own a Car?                      438557 non-null object
Own Property?                   438557 non-null object
# of Children                   438557 non-null int64
Annual Income                   438557 non-null float64
Income Category                 438557 non-null object
Education Level                 438557 non-null object
Marital Status                  438557 non-null object
Housing type                    438557 non-null object
Have a Mobile Phone?            438557 non-null int64
Have a Work Phone?              438557 non-null int64
Have a Phone?                   438557 non-null int64
Have an Email?                  438557 non-null int64
Occupation                      438557 non-null object
Family Size                     438557 non-null int64
Age                             438557 non-null int64
Years Working at Current Job    438557 non-null float64
dtypes: float64(2), int64(8), object(8)
memory usage: 63.6+ MB

In [16]:
# Now onto CrRecord_data

In [18]:
# Renaming the columns for CrRecord_data
CrRecord_data = CrRecord_data.rename(columns={"ID": "Client Number", "MONTHS_BALANCE": "Record Month","STATUS": "Status"})
CrRecord_data.head()

   Client Number  Record Month Status
0        5001711             0      X
1        5001711            -1      0
2        5001711            -2      0
3        5001711            -3      0
4        5001712             0      C

In [19]:
# CrRecord_data info
CrRecord_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
Client Number    1048575 non-null int64
Record Month     1048575 non-null int64
Status           1048575 non-null object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [19]:
# Dropping any possible duplicates in app_data
CrRecord_data = CrRecord_data.drop_duplicates()

In [20]:
# Updated dataframe information for CrRecord_data
CrRecord_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   Client Number  1048575 non-null  int64
 1   Record Month   1048575 non-null  int64
 2   Status         1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 32.0+ MB

In [1]:
# Exporting cleaned datasets to csv files
app_data.to_csv("Updated Application Records.csv")
CrRecord_data.to_csv("Updated Credit Records.csv")

# Sending Data to SQL Database

In [2]:
from sqlalchemy import create_engine
engine = create_engine("postgres://postgres:Gamecock2020!@localhost:5432/Project3")

In [3]:
# Sending app_data and CrRecord_data to the SQL database
app_data.to_sql("Application_Records_Data", engine)
CrRecord_data.to_sql("Credit_Records_Data", engine)

# ML Modeling - Logistic Regression Approach

In [20]:
# Merge the datasets
merged_df = pd.merge(app_data, CrRecord_data, on = "Client Number", how = "left")
merged_df.head()

,Client Number,Gender,Own a Car?,Own Property?,# of Children,Annual Income,Income Category,Education Level,Marital Status,Housing type,Have a Mobile Phone?,Have a Work Phone?,Have a Phone?,Have an Email?,Occupation,Family Size,Age,Years Working at Current Job,Record Month,Status
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5,0.0,C
1,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5,-1.0,C
2,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5,-2.0,C
3,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5,-3.0,C
4,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,1,1,0,0,N/A,2,33,12.5,-4.0,C

In [112]:
# Merged information
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1179815 entries, 0 to 1179814
Data columns (total 20 columns):
 #   Column                        Non-Null Count    Dtype
---  ------                        --------------    -----
 0   Client Number                 1179815 non-null  int64
 1   Gender                        1179815 non-null  object
 2   Own a Car?                    1179815 non-null  object
 3   Own Property?                 1179815 non-null  object
 4   # of Children                 1179815 non-null  int64
 5   Annual Income                 1179815 non-null  float64
 6   Income Category               1179815 non-null  object
 7   Education Level               1179815 non-null  object
 8   Marital Status                1179815 non-null  object
 9   Housing type                  1179815 non-null  object
 10  Have a Mobile Phone?          1179815 non-null  int64
 11  Have a Work Phone?            1179815 non-null  int64
 12  Have a Phone?                 1179815 non-null  int64
 13  Have an Email?                1179815 non-null  int64
 14  Occupation                    1179815 non-null  object
 15  Family Size                   1179815 non-null  int64
 16  Age                           1179815 non-null  int64
 17  Years Working at Current Job  1179815 non-null  float64
 18  Record Month                  777715 non-null   float64
 19  Status                        777715 non-null   object
dtypes: float64(3), int64(8), object(9)
memory usage: 189.0+ MB

In [21]:
# Dropping null values and showing updated merged information
merged_df = merged_df.dropna()
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 777715 entries, 0 to 1176070
Data columns (total 20 columns):
Client Number                   777715 non-null int64
Gender                          777715 non-null object
Own a Car?                      777715 non-null object
Own Property?                   777715 non-null object
# of Children                   777715 non-null int64
Annual Income                   777715 non-null float64
Income Category                 777715 non-null object
Education Level                 777715 non-null object
Marital Status                  777715 non-null object
Housing type                    777715 non-null object
Have a Mobile Phone?            777715 non-null int64
Have a Work Phone?              777715 non-null int64
Have a Phone?                   777715 non-null int64
Have an Email?                  777715 non-null int64
Occupation                      777715 non-null object
Family Size                     777715 non-null int64
Age                             777715 non-null int64
Years Working at Current Job    777715 non-null float64
Record Month                    777715 non-null float64
Status                          777715 non-null object
dtypes: float64(3), int64(8), object(9)
memory usage: 124.6+ MB

In [24]:
# Encoding merged_df
from sklearn.preprocessing import LabelEncoder
merged_df = merged_df.apply(LabelEncoder().fit_transform)
merged_df.head()

   Client Number  Gender  ...  Record Month  Status
0              0       1  ...            60       6
1              0       1  ...            59       6
2              0       1  ...            58       6
3              0       1  ...            57       6
4              0       1  ...            56       6

[5 rows x 20 columns]

In [25]:
# assigning y 
y = merged_df["Status"]

array([6, 6, 6, ..., 1, 0, 0])

In [76]:
# Assigning X
X = merged_df.drop("Status", axis=1)
X.head()

   Client Number  Gender  ...  Years Working at Current Job  Record Month
0              0       1  ...                           126            60
1              0       1  ...                           126            59
2              0       1  ...                           126            58
3              0       1  ...                           126            57
4              0       1  ...                           126            56

[5 rows x 19 columns]

In [77]:
# Import train_test_split
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [78]:
# Create classifier
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [79]:
# Fit the data
classifier.fit(X_train, y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [80]:
# Printing the training and testing scores
print(f"Training Data Score: {classifier.score(X_train, y_train)}")
print(f"Testing Data Score: {classifier.score(X_test, y_test)}")

Training Data Score: 0.45317905795784574
Testing Data Score: 0.4516198715212237

In [ ]:
# The logistic regression model did not give us the best results. We will try using a neural network approach next

# ML Modeling - Neural Network Approach

In [81]:
# Creating the model
from tensorflow.keras.models import Sequential

model = Sequential()

In [82]:
# reshape y
y = y.values.reshape(-1, 1)

In [83]:
# Import StandardScaler 
from sklearn.preprocessing import StandardScaler

X_scaler = StandardScaler().fit(X_train)

In [84]:
# Transform the training and testing data using the X_scaler

X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)

In [85]:
# One-hot encoding
from tensorflow.keras.utils import to_categorical
y_train_categorical = to_categorical(y_train)
y_test_categorical = to_categorical(y_test)

In [114]:
# Creating a normal neural network with 19 inputs, 38 hidden nodes, and 8 outputs
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense


model.add(Dense(units=38, activation='relu', input_dim=19))
model.add(Dense(units=8, activation='softmax'))

In [115]:
# Model summary
model.summary()

Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_15 (Dense)             (None, 38)                760
_________________________________________________________________
dense_16 (Dense)             (None, 8)                 312
=================================================================
Total params: 1,072
Trainable params: 1,072
Non-trainable params: 0
_________________________________________________________________

In [109]:
# Compile the model
model.compile(optimizer='adam',
              loss='categorical_crossentropy',
              metrics=['accuracy'])

In [97]:
# Fit the model to the training data
model.fit(
    X_train_scaled,
    y_train_categorical,
    epochs=50,
    shuffle=True,
    verbose=2
)

Epoch 1/50
18228/18228 - 15s - loss: 1.0700 - accuracy: 0.4878
Epoch 2/50
18228/18228 - 15s - loss: 1.0692 - accuracy: 0.4885
Epoch 3/50
18228/18228 - 15s - loss: 1.0685 - accuracy: 0.4892
Epoch 4/50
18228/18228 - 15s - loss: 1.0678 - accuracy: 0.4897
Epoch 5/50
18228/18228 - 15s - loss: 1.0675 - accuracy: 0.4903
Epoch 6/50
18228/18228 - 14s - loss: 1.0670 - accuracy: 0.4901
Epoch 7/50
18228/18228 - 15s - loss: 1.0668 - accuracy: 0.4906
Epoch 8/50
18228/18228 - 15s - loss: 1.0666 - accuracy: 0.4909
Epoch 9/50
18228/18228 - 15s - loss: 1.0664 - accuracy: 0.4908
Epoch 10/50
18228/18228 - 15s - loss: 1.0661 - accuracy: 0.4918
Epoch 11/50
18228/18228 - 15s - loss: 1.0658 - accuracy: 0.4915
Epoch 12/50
18228/18228 - 15s - loss: 1.0657 - accuracy: 0.4913
Epoch 13/50
18228/18228 - 15s - loss: 1.0655 - accuracy: 0.4913
Epoch 14/50
18228/18228 - 15s - loss: 1.0650 - accuracy: 0.4921
Epoch 15/50
18228/18228 - 15s - loss: 1.0647 - accuracy: 0.4917
Epoch 16/50
18228/18228 - 15s - loss: 1.0646 - accuracy: 0.4912
Epoch 17/50
18228/18228 - 15s - loss: 1.0641 - accuracy: 0.4919
Epoch 18/50
18228/18228 - 15s - loss: 1.0639 - accuracy: 0.4914
Epoch 19/50
18228/18228 - 15s - loss: 1.0634 - accuracy: 0.4924
Epoch 20/50
18228/18228 - 15s - loss: 1.0632 - accuracy: 0.4916
Epoch 21/50
18228/18228 - 15s - loss: 1.0629 - accuracy: 0.4929
Epoch 22/50
18228/18228 - 15s - loss: 1.0625 - accuracy: 0.4923
Epoch 23/50
18228/18228 - 15s - loss: 1.0621 - accuracy: 0.4924
Epoch 24/50
18228/18228 - 15s - loss: 1.0621 - accuracy: 0.4928
Epoch 25/50
18228/18228 - 15s - loss: 1.0619 - accuracy: 0.4926
Epoch 26/50
18228/18228 - 15s - loss: 1.0619 - accuracy: 0.4930
Epoch 27/50
18228/18228 - 15s - loss: 1.0619 - accuracy: 0.4932
Epoch 28/50
18228/18228 - 15s - loss: 1.0618 - accuracy: 0.4933
Epoch 29/50
18228/18228 - 15s - loss: 1.0617 - accuracy: 0.4937
Epoch 30/50
18228/18228 - 15s - loss: 1.0617 - accuracy: 0.4933
Epoch 31/50
18228/18228 - 15s - loss: 1.0618 - accuracy: 0.4927
Epoch 32/50
18228/18228 - 15s - loss: 1.0614 - accuracy: 0.4935
Epoch 33/50
18228/18228 - 15s - loss: 1.0616 - accuracy: 0.4931
Epoch 34/50
18228/18228 - 15s - loss: 1.0614 - accuracy: 0.4929
Epoch 35/50
18228/18228 - 14s - loss: 1.0615 - accuracy: 0.4926
Epoch 36/50
18228/18228 - 15s - loss: 1.0616 - accuracy: 0.4929
Epoch 37/50
18228/18228 - 15s - loss: 1.0613 - accuracy: 0.4934
Epoch 38/50
18228/18228 - 15s - loss: 1.0612 - accuracy: 0.4940
Epoch 39/50
18228/18228 - 15s - loss: 1.0611 - accuracy: 0.4930
Epoch 40/50
18228/18228 - 15s - loss: 1.0610 - accuracy: 0.4935
Epoch 41/50
18228/18228 - 15s - loss: 1.0611 - accuracy: 0.4931
Epoch 42/50
18228/18228 - 15s - loss: 1.0608 - accuracy: 0.4937
Epoch 43/50
18228/18228 - 15s - loss: 1.0609 - accuracy: 0.4936
Epoch 44/50
18228/18228 - 15s - loss: 1.0609 - accuracy: 0.4938
Epoch 45/50
18228/18228 - 15s - loss: 1.0609 - accuracy: 0.4931
Epoch 46/50
18228/18228 - 15s - loss: 1.0610 - accuracy: 0.4933
Epoch 47/50
18228/18228 - 15s - loss: 1.0607 - accuracy: 0.4938
Epoch 48/50
18228/18228 - 15s - loss: 1.0607 - accuracy: 0.4938
Epoch 49/50
18228/18228 - 15s - loss: 1.0604 - accuracy: 0.4940
Epoch 50/50
18228/18228 - 15s - loss: 1.0603 - accuracy: 0.4936

In [98]:
# Quantifying the trained model
model_loss, model_accuracy = model.evaluate(
    X_test_scaled, y_test_categorical, verbose=2)
print(
    f"Normal Neural Network - Loss: {model_loss}, Accuracy: {model_accuracy}")

6076/6076 - 4s - loss: 1.0612 - accuracy: 0.4886
Normal Neural Network - Loss: 1.0612194538116455, Accuracy: 0.4886462390422821

In [100]:
# Predictions
encoded_predictions = model.predict_classes(X_test_scaled[:10])
prediction_labels = label_encoder.inverse_transform(encoded_predictions)

print(f"Predicted classes: {prediction_labels}")
print(f"Actual Labels: {list(y_test[:10])}")

Predicted classes: [0 0 0 7 0 0 0 0 6 6]
Actual Labels: [array([6]), array([6]), array([6]), array([7]), array([6]), array([6]), array([6]), array([6]), array([6]), array([0])]

/usr/local/lib/python3.7/dist-packages/tensorflow/python/keras/engine/sequential.py:450: UserWarning: `model.predict_classes()` is deprecated and will be removed after 2021-01-01. Please use instead:* `np.argmax(model.predict(x), axis=-1)`,   if your model does multi-class classification   (e.g. if it uses a `softmax` last-layer activation).* `(model.predict(x) > 0.5).astype("int32")`,   if your model does binary classification   (e.g. if it uses a `sigmoid` last-layer activation).
  warnings.warn('`model.predict_classes()` is deprecated and '

# Adding Deep Learning to the Neural Network Model

In [116]:
# Creating the deep learning model
deep_model = Sequential()
deep_model.add(Dense(units=38, activation='relu', input_dim=19))
deep_model.add(Dense(units=38, activation='relu'))
deep_model.add(Dense(units=8, activation='softmax'))

In [117]:
# Deep model summary
deep_model.summary()

Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_17 (Dense)             (None, 38)                760
_________________________________________________________________
dense_18 (Dense)             (None, 38)                1482
_________________________________________________________________
dense_19 (Dense)             (None, 8)                 312
=================================================================
Total params: 2,554
Trainable params: 2,554
Non-trainable params: 0
_________________________________________________________________

In [104]:
# Compiling and fitting the model
deep_model.compile(optimizer='adam',
                   loss='categorical_crossentropy',
                   metrics=['accuracy'])

deep_model.fit(
    X_train_scaled,
    y_train_categorical,
    epochs=50,
    shuffle=True,
    verbose=2
)

Epoch 1/50
18228/18228 - 17s - loss: 1.0848 - accuracy: 0.4833
Epoch 2/50
18228/18228 - 17s - loss: 1.0529 - accuracy: 0.5037
Epoch 3/50
18228/18228 - 17s - loss: 1.0370 - accuracy: 0.5140
Epoch 4/50
18228/18228 - 17s - loss: 1.0274 - accuracy: 0.5197
Epoch 5/50
18228/18228 - 17s - loss: 1.0215 - accuracy: 0.5238
Epoch 6/50
18228/18228 - 17s - loss: 1.0172 - accuracy: 0.5262
Epoch 7/50
18228/18228 - 17s - loss: 1.0138 - accuracy: 0.5275
Epoch 8/50
18228/18228 - 17s - loss: 1.0108 - accuracy: 0.5304
Epoch 9/50
18228/18228 - 17s - loss: 1.0081 - accuracy: 0.5327
Epoch 10/50
18228/18228 - 17s - loss: 1.0056 - accuracy: 0.5343
Epoch 11/50
18228/18228 - 17s - loss: 1.0038 - accuracy: 0.5359
Epoch 12/50
18228/18228 - 17s - loss: 1.0021 - accuracy: 0.5367
Epoch 13/50
18228/18228 - 17s - loss: 1.0006 - accuracy: 0.5379
Epoch 14/50
18228/18228 - 17s - loss: 0.9995 - accuracy: 0.5396
Epoch 15/50
18228/18228 - 17s - loss: 0.9983 - accuracy: 0.5395
Epoch 16/50
18228/18228 - 17s - loss: 0.9971 - accuracy: 0.5400
Epoch 17/50
18228/18228 - 17s - loss: 0.9965 - accuracy: 0.5406
Epoch 18/50
18228/18228 - 17s - loss: 0.9955 - accuracy: 0.5408
Epoch 19/50
18228/18228 - 17s - loss: 0.9953 - accuracy: 0.5408
Epoch 20/50
18228/18228 - 17s - loss: 0.9944 - accuracy: 0.5431
Epoch 21/50
18228/18228 - 17s - loss: 0.9937 - accuracy: 0.5429
Epoch 22/50
18228/18228 - 18s - loss: 0.9933 - accuracy: 0.5426
Epoch 23/50
18228/18228 - 17s - loss: 0.9924 - accuracy: 0.5434
Epoch 24/50
18228/18228 - 17s - loss: 0.9917 - accuracy: 0.5438
Epoch 25/50
18228/18228 - 17s - loss: 0.9913 - accuracy: 0.5444
Epoch 26/50
18228/18228 - 18s - loss: 0.9909 - accuracy: 0.5443
Epoch 27/50
18228/18228 - 17s - loss: 0.9905 - accuracy: 0.5444
Epoch 28/50
18228/18228 - 17s - loss: 0.9896 - accuracy: 0.5454
Epoch 29/50
18228/18228 - 17s - loss: 0.9895 - accuracy: 0.5449
Epoch 30/50
18228/18228 - 18s - loss: 0.9887 - accuracy: 0.5458
Epoch 31/50
18228/18228 - 18s - loss: 0.9883 - accuracy: 0.5456
Epoch 32/50
18228/18228 - 17s - loss: 0.9883 - accuracy: 0.5461
Epoch 33/50
18228/18228 - 17s - loss: 0.9879 - accuracy: 0.5469
Epoch 34/50
18228/18228 - 17s - loss: 0.9876 - accuracy: 0.5467
Epoch 35/50
18228/18228 - 17s - loss: 0.9872 - accuracy: 0.5474
Epoch 36/50
18228/18228 - 17s - loss: 0.9870 - accuracy: 0.5476
Epoch 37/50
18228/18228 - 17s - loss: 0.9867 - accuracy: 0.5481
Epoch 38/50
18228/18228 - 17s - loss: 0.9862 - accuracy: 0.5472
Epoch 39/50
18228/18228 - 18s - loss: 0.9860 - accuracy: 0.5480
Epoch 40/50
18228/18228 - 18s - loss: 0.9858 - accuracy: 0.5481
Epoch 41/50
18228/18228 - 17s - loss: 0.9855 - accuracy: 0.5483
Epoch 42/50
18228/18228 - 17s - loss: 0.9855 - accuracy: 0.5487
Epoch 43/50
18228/18228 - 17s - loss: 0.9852 - accuracy: 0.5485
Epoch 44/50
18228/18228 - 17s - loss: 0.9847 - accuracy: 0.5491
Epoch 45/50
18228/18228 - 17s - loss: 0.9848 - accuracy: 0.5483
Epoch 46/50
18228/18228 - 17s - loss: 0.9845 - accuracy: 0.5487
Epoch 47/50
18228/18228 - 17s - loss: 0.9845 - accuracy: 0.5489
Epoch 48/50
18228/18228 - 18s - loss: 0.9843 - accuracy: 0.5490
Epoch 49/50
18228/18228 - 17s - loss: 0.9841 - accuracy: 0.5489
Epoch 50/50
18228/18228 - 17s - loss: 0.9839 - accuracy: 0.5481

In [105]:
# Quantifying the deep learning model
model_loss, model_accuracy = deep_model.evaluate(
    X_test_scaled, y_test_categorical, verbose=2)
print(f"Deep Neural Network - Loss: {model_loss}, Accuracy: {model_accuracy}")

6076/6076 - 4s - loss: 0.9882 - accuracy: 0.5476
Deep Neural Network - Loss: 0.9882339239120483, Accuracy: 0.5476189255714417

In [119]:
# Predictions
encoded_predictions = model.predict_classes(X_test_scaled[:10])
prediction_labels = label_encoder.inverse_transform(encoded_predictions)

print(f"Predicted classes: {prediction_labels}")
print(f"Actual Labels: {y_test[:10]}")

Predicted classes: [6 0 6 0 1 6 6 6 4 3]
Actual Labels: [[6]
 [6]
 [6]
 [7]
 [6]
 [6]
 [6]
 [6]
 [6]
 [0]]

/usr/local/lib/python3.7/dist-packages/tensorflow/python/keras/engine/sequential.py:450: UserWarning: `model.predict_classes()` is deprecated and will be removed after 2021-01-01. Please use instead:* `np.argmax(model.predict(x), axis=-1)`,   if your model does multi-class classification   (e.g. if it uses a `softmax` last-layer activation).* `(model.predict(x) > 0.5).astype("int32")`,   if your model does binary classification   (e.g. if it uses a `sigmoid` last-layer activation).
  warnings.warn('`model.predict_classes()` is deprecated and '